## Terraform Plan Results

| Check | Status |
|-------|--------|
| **Format** | ✅ `success` |
| **Initialization** | ✅ `success` |
| **Validation** | ✅ `success` |
| **Plan** | ❌ `failure` |

<details><summary><b>📋 Show Plan Output</b></summary>

```terraform
data.aws_ami.amazon_linux_2023: Reading...
data.aws_elb_service_account.main: Reading...
data.aws_iam_policy_document.ec2_assume: Reading...
data.aws_secretsmanager_secret.oidc: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.flowlogs_assume: Reading...
data.aws_s3_bucket.alb_logs: Reading...
data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
data.aws_iam_policy_document.ec2_assume: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.flowlogs_assume: Read complete after 0s [id=2717921857]
data.aws_s3_bucket.alb_logs: Read complete after 0s [id=test-bucket-terraform-state-v1]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-02f058bc6b3ee6fcc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.flowlogs_write will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "flowlogs_write" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.service_cert[0] will be created
  + resource "aws_acm_certificate" "service_cert" {
      + arn                       = (known after apply)
      + domain_name               = "xxx.example.com"
      + domain_validation_options = [
          + {
              + domain_name           = "xxx.example.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "xxx.example.com",
        ]
      + tags                      = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-cert"
          + "Project"   = "myproject"
        }
      + tags_all                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-cert"
          + "Project"   = "myproject"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.service_cert[0] will be created
  + resource "aws_acm_certificate_validation" "service_cert" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
      + region          = "us-east-1"

      + timeouts {
          + create = "45m"
        }
    }

  # aws_cloudwatch_log_group.vpc_flow will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + kms_key_id                  = "arn:aws:kms:us-east-1:594515826734:key/6aed7c4e-3a65-455a-b8bb-f65a19f0d4ee"
      + log_group_class             = (known after apply)
      + name                        = "/aws/vpc/myproject-dev/flowlogs"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all                    = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
    }

  # aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "myprojectdev"
      + db_subnet_group_name                  = "myproject-dev-rds-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.4"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "myproject-dev-final-snapshot"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "myproject-dev-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "us-east-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-postgres"
          + "Project"   = "myproject"
        }
      + tags_all                              = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-postgres"
          + "Project"   = "myproject"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "myproject-dev-rds-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "us-east-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-rds-subnet-group"
          + "Project"   = "myproject"
        }
      + tags_all                = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-rds-subnet-group"
          + "Project"   = "myproject"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-nat-eip"
          + "Project"   = "myproject"
        }
      + tags_all             = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-nat-eip"
          + "Project"   = "myproject"
        }
    }

  # aws_flow_log.this will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + max_aggregation_interval = 600
      + region                   = "us-east-1"
      + tags                     = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all                 = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_instance_profile.ec2_service will be created
  + resource "aws_iam_instance_profile" "ec2_service" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "myproject-dev-ec2-service-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "myproject-dev-ec2-service-role"
      + tags        = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_service will be created
  + resource "aws_iam_role" "ec2_service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "myproject-dev-ec2-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.flowlogs will be created
  + resource "aws_iam_role" "flowlogs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "myproject-dev-vpc-flowlogs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.flowlogs_write will be created
  + resource "aws_iam_role_policy" "flowlogs_write" {
      + id          = (known after apply)
      + name        = "myproject-dev-vpc-flowlogs-write"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2_ssm will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "myproject-dev-ec2-service-role"
    }

  # aws_instance.service will be created
  + resource "aws_instance" "service" {
      + ami                                  = "ami-02f058bc6b3ee6fcc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "myproject-dev-ec2-service-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service"
          + "Project"   = "myproject"
        }
      + tags_all                             = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service"
          + "Project"   = "myproject"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-igw"
          + "Project"   = "myproject"
        }
      + tags_all = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-igw"
          + "Project"   = "myproject"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "myproject-dev-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-alb"
          + "Project"   = "myproject"
        }
      + tags_all                                                     = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-alb"
          + "Project"   = "myproject"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "test-bucket-terraform-state-v1"
          + enabled = true
          + prefix  = "alb-logs"
        }
    }

  # aws_lb_listener.http[0] will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Forbidden"
              + status_code  = "403"
            }
        }
    }

  # aws_lb_target_group.service will be created
  + resource "aws_lb_target_group" "service" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "myproject-dev-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5678
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service-tg"
          + "Project"   = "myproject"
        }
      + tags_all                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service-tg"
          + "Project"   = "myproject"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 3600
          + enabled         = true
          + type            = "lb_cookie"
        }
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-nat"
          + "Project"   = "myproject"
        }
      + tags_all                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-nat"
          + "Project"   = "myproject"
        }
      + vpc_id                             = (known after apply)
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_default will be created
  + resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-rt"
          + "Project"   = "myproject"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-rt"
          + "Project"   = "myproject"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-rt"
          + "Project"   = "myproject"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-rt"
          + "Project"   = "myproject"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private["0"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private["1"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["0"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["1"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket_policy.alb_logs will be created
  + resource "aws_s3_bucket_policy" "alb_logs" {
      + bucket = "test-bucket-terraform-state-v1"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::127311923021:root"
                        }
                      + Resource  = "arn:aws:s3:::test-bucket-terraform-state-v1/alb-logs/AWSLogs/*"
                      + Sid       = "AllowALBLogDelivery"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + "s3:x-amz-acl" = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::test-bucket-terraform-state-v1/alb-logs/AWSLogs/*"
                      + Sid       = "AllowLogDeliveryService"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::test-bucket-terraform-state-v1"
                      + Sid       = "AllowGetBucketAcl"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region = "us-east-1"
    }

  # aws_secretsmanager_secret.rds_credentials will be created
  + resource "aws_secretsmanager_secret" "rds_credentials" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "myproject/dev/rds-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + region                         = "us-east-1"
      + tags                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
      + tags_all                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Project"   = "myproject"
        }
    }

  # aws_secretsmanager_secret_version.rds_credentials will be created
  + resource "aws_secretsmanager_secret_version" "rds_credentials" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "ALB SG"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "myproject-dev-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-alb-sg"
          + "Project"   = "myproject"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-alb-sg"
          + "Project"   = "myproject"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "RDS SG (only from service on 5432)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "myproject-dev-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-rds-sg"
          + "Project"   = "myproject"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-rds-sg"
          + "Project"   = "myproject"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.service will be created
  + resource "aws_security_group" "service" {
      + arn                    = (known after apply)
      + description            = "service app SG (only from ALB, no SSH)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "myproject-dev-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service-sg"
          + "Project"   = "myproject"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-service-sg"
          + "Project"   = "myproject"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private["0"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-us-east-1a"
          + "Project"   = "myproject"
          + "Tier"      = "private"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-us-east-1a"
          + "Project"   = "myproject"
          + "Tier"      = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private["1"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-us-east-1b"
          + "Project"   = "myproject"
          + "Tier"      = "private"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-private-us-east-1b"
          + "Project"   = "myproject"
          + "Tier"      = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public["0"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-us-east-1a"
          + "Project"   = "myproject"
          + "Tier"      = "public"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-us-east-1a"
          + "Project"   = "myproject"
          + "Tier"      = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public["1"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-us-east-1b"
          + "Project"   = "myproject"
          + "Tier"      = "public"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-public-us-east-1b"
          + "Project"   = "myproject"
          + "Tier"      = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-vpc"
          + "Project"   = "myproject"
        }
      + tags_all                             = {
          + "Env"       = "dev"
          + "ManagedBy" = "terraform"
          + "Name"      = "myproject-dev-vpc"
          + "Project"   = "myproject"
        }
    }

  # aws_vpc_security_group_egress_rule.alb_to_azure_oidc will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_to_azure_oidc" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "ALB to Azure OIDC endpoints for token verification"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # aws_vpc_security_group_egress_rule.alb_to_service will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_to_service" {
      + arn                          = (known after apply)
      + description                  = "To service SG on app port"
      + from_port                    = 5678
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 5678
    }

  # aws_vpc_security_group_egress_rule.rds_all_out will be created
  + resource "aws_vpc_security_group_egress_rule" "rds_all_out" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "RDS outbound"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_egress_rule.service_all_out will be created
  + resource "aws_vpc_security_group_egress_rule" "service_all_out" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "service outbound"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.alb_443_in will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_443_in" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTPS from internet"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # aws_vpc_security_group_ingress_rule.alb_80_in[0] will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_80_in" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTP from internet (redirect to HTTPS)"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.rds_from_service will be created
  + resource "aws_vpc_security_group_ingress_rule" "rds_from_service" {
      + arn                          = (known after apply)
      + description                  = "Postgres from service SG only"
      + from_port                    = 5432
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 5432
    }

  # aws_vpc_security_group_ingress_rule.service_from_alb will be created
  + resource "aws_vpc_security_group_ingress_rule" "service_from_alb" {
      + arn                          = (known after apply)
      + description                  = "App port from ALB only"
      + from_port                    = 5678
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + securi

... (output truncated)
```

</details>

---

**Workflow:** `Terraform Plan (Pull Request)` | **Event:** `pull_request`
**Triggered by:** @skysea-devops | **Commit:** `25c0ec4b3b819665e56ef2c0849f186768d9ab4c`

❌ **Plan failed!** Check the logs for details.
